<template>
  <Page>
    <template #body>
      <h2>Aleo プロジェクト概要</h2>

      <div class='faq-content'>
        <div class='faq-content-nav'>
          <h3>ナビゲーション</h3>

          <ul class='faq-nav-links'>
            <li><a @click='scrollTo("Aleo マイニング製品")'>Aleo マイニング製品</a></li>
            <li><a @click='scrollTo("Aleo とは")'>Aleo とは</a></li>
            <li><a @click='scrollTo("Aleoの技術概要")'>Aleoの技術概要</a></li>
            <li><a @click='scrollTo("なぜAleoを選定したか？")'>なぜAleoを選定したか？</a></li>
            <li><a @click='scrollTo("Aleoマイニングは誰でも購入できますか？")'>Aleoマイニングは誰でも購入できますか？</a></li>
            <li><a @click='scrollTo("Aleoマイニングの購入はいつまで可能ですか？")'>Aleoマイニングの購入はいつまで可能ですか？</a></li>
            <li><a @click='scrollTo("メインネットのローンチ時期はまだ決定していないのですか？")'>メインネットのローンチ時期はまだ決定していないのですか？</a></li>
            <li><a @click='scrollTo("AleoをBTCで購入する際には、なぜ10%の決済手数料が上乗せされるのですか？")'>AleoをBTCで購入する際には、なぜ10%の決済手数料が上乗せされるのですか？</a></li>
          </ul>

          <div class='hr' />
        </div>

        <div class='faq-content-main'>
          <h3 id='Aleo マイニング製品'>
            Aleo マイニング製品
          </h3>

          <h4>製品詳細</h4>

          <p><strong>マイニング開始時期: </strong>メインネットでローンチ時 (ローンチ想定は2022年12月だが、Aleo公式からの正確な日付は未発表)</p>

          <p><strong>マイニング期間: </strong>365日間 (メインネットローンチ後)</p>

          <p><strong>技術サービス料: </strong>20%</p>

          <h3 id='Aleo とは'>
            Aleo とは
          </h3>

          <p>Aleo Systems Inc. が開発・運営するWeb3のプライバシー保護に重視したレイヤー１の暗号資産プロジェクトです。</p>

          <h4>Aleo 開発・運営会社情報</h4>

          <ul>
            <li><strong>法人名: </strong>Aleo Systems Inc.</li>
            <li><strong>所在地: </strong>リノ、ネバダ州、アメリカ</li>
            <li><strong>創設日: </strong>2019年</li>
            <li><strong>テストネット1 開始日: </strong>2021年第1四半期</li>
            <li><strong>テストネット2 開始日: </strong>2021年12月6日</li>
            <li><strong>テストネット3 開始日: </strong>2022年8月2日</li>
            <li><strong>メインネットローンチ想定日: </strong>2022年12月 (Aleo公式からの正確な日付は未発表)</li>
            <li><a href='https://www.aleo.org/post/aleo-token-economics' target='_blank'>Aleo トークンエコノミー</a></li>
          </ul>

          <h3>4名の創業者</h3>

          <h4>Howard Hu</h4>

          <p>UCバークレー校を卒業後、Googleにエンジニアとして入社。その後バークレー校のブロックチェーンアクセラレーターとして務め、 Dekrypt Capitalでは10年以上ブロックチェーンに携わる。</p>

          <h4>Collin Chin</h4>

          <p>UCバークレー校在学中にConsenSysでスマートコントラクト開発者としてインターンを経験。Blockchain at BerkeleyとArgusでは、テクニカルアドバイザー兼セキュリティコンサルタントを務める。</p>

          <h4>Raymond Chu</h4>

          <p>UCバークレー校在学中、IBMとAmazonでエンジニアとしてインターンを経験。その後、Blockchain at BerkeleyとArgusでプロジェクト・マネージャー兼セキュリティ・コンサルタントを務める。</p>

          <h4>Michael Beller</h4>

          <p>アクセンチュアで7年間シニアマネージャーを務める。数々のIT/金融系スタートアップでCOO/CIOを歴任。</p>

          <h3 id='Aleoの技術概要'>
            Aleoの技術概要
          </h3>

          <h4>Aleoは、完全なプライベートアプリケーションを提供する史上初のレイヤー1 プラットフォームです。</h4>

          <p>分散型システムとゼロ知識暗号技術を活用し、ウェブ上のユーザーデータを保護することで、プライバシーを実現します。</p>

          <p>ゼロ知識暗号技術を使用することで、スマートコントラクトの実行をオフチェーンに移行し、完全なプライベート性と毎秒数万件のト ランザクションに対応できる多様な分散型アプリケーションを可能にします。オープンなパブリックブロックチェーン上に構築されたAleoは、 イーサリアムのようにアプリケーションをそのブロックチェーン上で構築できる機能性を持ち、レイヤー1 であるため構築されたアプリケーションが完全にプライベートになるという非常に革新的なテクノロジーを持ちます。</p>

          <h3 id='なぜAleoを選定したか？'>
            なぜAleoを選定したか？
          </h3>

          <p>Aleoはたった2回の資金調達ラウンドで約255億円 (2.28億ドル)を調達し、上場前の評価額は約1852億円 (14.5億ドル) に達しました。この資金調達は、ゼロ知識証明技術の業界において過去最大の資金調達ラウンドとなります。</p>

          <p>Aleoに出資している機関投資家は、日本の投資ファンドソフトバンクビジョン業界トップのa16zをはじめ、Polychain Capital、取引所のCoinbaseやその他多くが本プロジェクトに期待をしバックアップしております。</p>

          <p>ソフトバンクが暗号資産プロジェクトに投資するのは、非常に稀なことです。ソフトバンクはAleoに投資を行なっただけではなく、Aleoの役員会にも就任しています。</p>

          <p>運営・開発チームのバックグラウンドに関しても、Aleoのチームは非常に優秀な人材が揃い、サービスをどのような流れで顧客へ届けるかの包括的な戦略能力を備えています。</p>

          <p>技術面では、ゼロ知識証明 (ZKP) により、Web3の将来性に最も重要なインフラの1つを提供します。</p>

          <p>Aleoの今後のエコシステムについては、レイヤー1 の技術により、次のEthereumやSolanaになりえる可能性を秘めています。 すでにゲーム会社のForteと提携したようにAleo上で様々なアプリケーションが開発されることになります。また、 Web2の世界で問題視されているデータの漏洩、個人データの売買、漏洩したデータを永続的に利用されてしまうことなどの解決策となり得るでしょう。</p>

          <h3 id='Aleoマイニングは誰でも購入できますか？'>
            Aleoマイニングは誰でも購入できますか？
          </h3>

          <p>当プラットフォームへご登録されている皆様はご購入可能でございます。また当プラットフォームは招待制のため、招待された私どもと深い関係性のあるコミュニティにのみご案内させていただいております。</p>

          <h3 id='Aleoマイニングの購入はいつまで可能ですか？'>
            Aleoマイニングの購入はいつまで可能ですか？
          </h3>

          <p>2022年9月20日時点、Aleoファーストバッチマイニングの購入締め切りは、2022年11月20日です。</p>

          <h3 id='メインネットのローンチ時期はまだ決定していないのですか？'>
            メインネットのローンチ時期はまだ決定していないのですか？
          </h3>

          <p>暗号資産プロジェクトの大半と同様に、Aleo公式もロードマップを設定し、常に本プロジェクトが前進するように尽力しています。Aleoのテストネット3のローンチに関しては、Aleoの準備が整い次第ローンチするため正確なローンチ日は、メインネットに移行する準備が整うかどうかに依存することになります。Procyonは、進捗があり次第コミュニティの皆さまに報告をさせていただきます。なお、Aleoのツイッターをご覧いただくことで、引き続き最新情報を入手することができます。</p>

          <h3 id='AleoをBTCで購入する際には、なぜ10%の決済手数料が上乗せされるのですか？'>
            AleoをBTCで購入する際には、なぜ10%の決済手数料が上乗せされるのですか？
          </h3>

          <p>お客様がBTCでお支払いする場合、BTCの価格変動により不足金が発生しないよう、USDT/BTCの為替レートに10%程度の決済手数料を上乗せしております。</p>

          <p>上記はあくまで変動しやすいBTCのリスクをヘッジするためのものであり、当プラットフォームが利益を上げるためのものではありません。</p>

          <p>ハードウェアやスタッフのコストはすべて米ドルで支払っているので、USDTのような安定したコインを使い、799USDTを1口として設定しております。</p>

          <p>BTCの支払いを受けて、米ドルへの交換が遅延した場合、損失を出す可能性があります。そのため、便宜的には支払い方法としてBTCを取り扱っていますが、<strong>全ての購入者の皆様にUSDTでの購入をお勧めしております</strong>。</p>

          <div class='hr' />
        </div>
      </div>
    </template>
  </Page>
</template>

<script setup lang='ts'>
import { defineAsyncComponent } from 'vue'
import { scrollTo } from 'src/utils/scroll'

const Page = defineAsyncComponent(() => import('src/pages/faq/Page.vue'))

</script>
