<template>
  <Page>
    <template #body>
      <h2>Aleo概要</h2>

      <div class='faq-content'>
        <div class='faq-content-nav'>
          <h3>目次</h3>

          <ul class='faq-nav-links'>
            <li><a @click='scrollTo("Aleo マイニング製品")'>Aleo マイニング製品</a></li>
            <li><a @click='scrollTo("Aleo とは")'>Aleo とは</a></li>
            <li><a @click='scrollTo("Aleoの技術概要")'>Aleoの技術概要</a></li>
            <li><a @click='scrollTo("なぜAleoを選定したか？")'>なぜAleoを選定したか？</a></li>
            <li><a @click='scrollTo("Aleoマイニングは誰でも購入できますか？")'>Aleoマイニングは誰でも購入できますか？</a></li>
            <li><a @click='scrollTo("Aleoマイニングの購入はいつまで可能ですか？")'>Aleoマイニングの購入はいつまで可能ですか？</a></li>
            <li><a @click='scrollTo("メインネットのローンチ時期はまだ決定していないのですか？")'>メインネットのローンチ時期はまだ決定していないのですか？</a></li>
            <li><a @click='scrollTo("AleoをBTCで購入する際には、なぜ10%の決済手数料が上乗せされるのですか？")'>AleoをBTCで購入する際には、なぜ10%の決済手数料が上乗せされるのですか？</a></li>
            <li><a @click='scrollTo("Aleoプルーバー・インセンティブ・プログラムとは？")'>Aleoプルーバー・インセンティブ・プログラムとは？</a></li>
            <li><a @click='scrollTo("Aleoプルーバー・インセンティブ・プログラムの参加方法とは？")'>Aleoプルーバー・インセンティブ・プログラムの参加方法とは？</a></li>
            <li><a @click='scrollTo("Aleoプルーバー・インセンティブ・プログラムで取得できるテストネット報酬はいくらですか？")'>Aleoプルーバー・インセンティブ・プログラムで取得できるテストネット報酬はいくらですか？</a></li>
            <li><a @click='scrollTo("Aleoファーストバッチマイニングは、1口でどれくらいのハッシュパワーが得られますか？")'>Aleoファーストバッチマイニングは、1口でどれくらいのハッシュパワーが得られますか？</a></li>
            <li><a @click='scrollTo("マイニング報酬は、マイニングが開始された日の翌日からProcyon.vipで確認できますか？")'>マイニング報酬は、マイニングが開始された日の翌日からProcyon.vipで確認できますか？</a></li>
            <li><a @click='scrollTo("マイニングマシンが停電などのトラブルで機能停止することはないでしょうか？")'>マイニングマシンが停電などのトラブルで機能停止することはないでしょうか？</a></li>
            <li><a @click='scrollTo("テストネットのマイニング報酬はProcyon.vipで確認できますか？")'>テストネットのマイニング報酬はProcyon.vipで確認できますか？</a></li>
            <li><a @click='scrollTo("テストネット報酬はどのくらい獲得できますか？")'>テストネット報酬はどのくらい獲得できますか？</a></li>
            <li><a @click='scrollTo("マイニング報酬はいつから出金できますか？")'>マイニング報酬はいつから出金できますか？</a></li>
            <li><a @click='scrollTo("マイニング報酬および残高の出金上限はありますか？")'>マイニング報酬および残高の出金上限はありますか？</a></li>
          </ul>

          <div class='hr' />
        </div>

        <div class='faq-content-main'>
          <h3 id='Aleo マイニング製品'>
            Aleo マイニング製品
          </h3>

          <h4>製品詳細</h4>

          <p><strong>マイニング開始時期: </strong>Aleoのプロジェクトチームによる正式決定・発表時。最新情報に関しましては、毎週日曜日に開催されるProcyon公式セミナーにご参加ください。</p>

          <p><strong>マイニング期間: </strong>365日間 (メインネットローンチ後)</p>

          <p><strong>技術サービス料: </strong>20%</p>

          <h3 id='Aleo とは'>
            Aleo とは
          </h3>

          <p>Aleo Systems Inc. が開発・運営するWeb3のプライバシー保護に重視したレイヤー１の暗号資産プロジェクトです。</p>

          <h4>Aleo 開発・運営会社情報</h4>

          <ul>
            <li><strong>法人名: </strong>Aleo Systems Inc.</li>
            <li><strong>所在地: </strong>リノ、ネバダ州、アメリカ</li>
            <li><strong>創設日: </strong>2019年</li>
            <li><strong>テストネット1 開始日: </strong>2021年第1四半期</li>
            <li><strong>テストネット2 開始日: </strong>2021年12月6日</li>
            <li><strong>テストネット3 開始日: </strong>2022年8月2日</li>
            <li><strong>メインネットローンチ想定日: </strong>2022年12月 (Aleo公式からの正確な日付は未発表)</li>
            <li><a href='https://www.aleo.org/post/aleo-token-economics' target='_blank'>Aleo トークンエコノミー</a></li>
          </ul>

          <h3>4名の創業者</h3>

          <h4>Howard Hu</h4>

          <p>UCバークレー校を卒業後、Googleにエンジニアとして入社。その後バークレー校のブロックチェーンアクセラレーターとして務め、 Dekrypt Capitalでは10年以上ブロックチェーンに携わる。</p>

          <h4>Collin Chin</h4>

          <p>UCバークレー校在学中にConsenSysでスマートコントラクト開発者としてインターンを経験。Blockchain at BerkeleyとArgusでは、テクニカルアドバイザー兼セキュリティコンサルタントを務める。</p>

          <h4>Raymond Chu</h4>

          <p>UCバークレー校在学中、IBMとAmazonでエンジニアとしてインターンを経験。その後、Blockchain at BerkeleyとArgusでプロジェクト・マネージャー兼セキュリティ・コンサルタントを務める。</p>

          <h4>Michael Beller</h4>

          <p>アクセンチュアで7年間シニアマネージャーを務める。数々のIT/金融系スタートアップでCOO/CIOを歴任。</p>

          <h3 id='Aleoの技術概要'>
            Aleoの技術概要
          </h3>

          <h4>Aleoは、完全なプライベートアプリケーションを提供する史上初のレイヤー1 プラットフォームです。</h4>

          <p>分散型システムとゼロ知識暗号技術を活用し、ウェブ上のユーザーデータを保護することで、プライバシーを実現します。</p>

          <p>ゼロ知識暗号技術を使用することで、スマートコントラクトの実行をオフチェーンに移行し、完全なプライベート性と毎秒数万件のト ランザクションに対応できる多様な分散型アプリケーションを可能にします。オープンなパブリックブロックチェーン上に構築されたAleoは、 イーサリアムのようにアプリケーションをそのブロックチェーン上で構築できる機能性を持ち、レイヤー1 であるため構築されたアプリケーションが完全にプライベートになるという非常に革新的なテクノロジーを持ちます。</p>

          <h3 id='なぜAleoを選定したか？'>
            なぜAleoを選定したか？
          </h3>

          <p>Aleoはたった2回の資金調達ラウンドで約255億円 (2.28億ドル)を調達し、上場前の評価額は約1852億円 (14.5億ドル) に達しました。この資金調達は、ゼロ知識証明技術の業界において過去最大の資金調達ラウンドとなります。</p>

          <p>Aleoに出資している機関投資家は、日本の投資ファンドソフトバンクビジョン業界トップのa16zをはじめ、Polychain Capital、取引所のCoinbaseやその他多くが本プロジェクトに期待をしバックアップしております。</p>

          <p>ソフトバンクが暗号資産プロジェクトに投資するのは、非常に稀なことです。ソフトバンクはAleoに投資を行なっただけではなく、Aleoの役員会にも就任しています。</p>

          <p>運営・開発チームのバックグラウンドに関しても、Aleoのチームは非常に優秀な人材が揃い、サービスをどのような流れで顧客へ届けるかの包括的な戦略能力を備えています。</p>

          <p>技術面では、ゼロ知識証明 (ZKP) により、Web3の将来性に最も重要なインフラの1つを提供します。</p>

          <p>Aleoの今後のエコシステムについては、レイヤー1 の技術により、次のEthereumやSolanaになりえる可能性を秘めています。 すでにゲーム会社のForteと提携したようにAleo上で様々なアプリケーションが開発されることになります。また、 Web2の世界で問題視されているデータの漏洩、個人データの売買、漏洩したデータを永続的に利用されてしまうことなどの解決策となり得るでしょう。</p>

          <h3 id='Aleoマイニングは誰でも購入できますか？'>
            Aleoマイニングは誰でも購入できますか？
          </h3>

          <p>当プラットフォームへご登録されている皆様はご購入可能でございます。また当プラットフォームは招待制のため、招待された私どもと深い関係性のあるコミュニティにのみご案内させていただいております。</p>

          <h3 id='Aleoマイニングの購入はいつまで可能ですか？'>
            Aleoマイニングの購入はいつまで可能ですか？
          </h3>

          <p>Aleoファーストバッチマイニング製品は、メインネットローンチ前に販売を終了いたします。最新情報に関しましては、毎週日曜日に開催されるProcyon公式セミナーにご参加ください。</p>

          <h3 id='メインネットのローンチ時期はまだ決定していないのですか？'>
            メインネットのローンチ時期はまだ決定していないのですか？
          </h3>

          <p>暗号資産プロジェクトの大半と同様に、Aleo公式もロードマップを設定し、常に本プロジェクトが前進するように尽力しています。Aleoのテストネット3のローンチに関しては、Aleoの準備が整い次第ローンチするため正確なローンチ日は、メインネットに移行する準備が整うかどうかに依存することになります。Procyonは、進捗があり次第コミュニティの皆さまに報告をさせていただきます。なお、Aleoのツイッターをご覧いただくことで、引き続き最新情報を入手することができます。</p>

          <h3 id='AleoをBTCで購入する際には、なぜ10%の決済手数料が上乗せされるのですか？'>
            AleoをBTCで購入する際には、なぜ10%の決済手数料が上乗せされるのですか？
          </h3>

          <p>お客様がBTCでお支払いする場合、BTCの価格変動により不足金が発生しないよう、USDT/BTCの為替レートに10%程度の決済手数料を上乗せしております。</p>

          <p>上記はあくまで変動しやすいBTCのリスクをヘッジするためのものであり、当プラットフォームが利益を上げるためのものではありません。</p>

          <p>ハードウェアやスタッフのコストはすべて米ドルで支払っているので、USDTのような安定したコインを使い、799USDTを1口として設定しております。</p>

          <p>BTCの支払いを受けて、米ドルへの交換が遅延した場合、損失を出す可能性があります。そのため、便宜的には支払い方法としてBTCを取り扱っていますが、<strong>全ての購入者の皆様にUSDTでの購入をお勧めしております</strong>。</p>

          <h3 id='Aleoプルーバー・インセンティブ・プログラムとは？'>
            Aleoプルーバー・インセンティブ・プログラムとは？
          </h3>

          <p>2022年12月2日より、Aleoはテストネット参加者を対象としたプルーバー・インセンティブ・プログラムを開始しました。これは、ファーストバッチマイニング参加者にとって重要なニュースです。テストネットの段階で弊社マイニングプールパートナーがマイニングしたAleoクレジット（テストネット報酬）が、メインネットローンチ時に5対1の割合（20%）でAleoトークンに交換できるようになります。つまり、メインネットローンチ前からROIが発生していることを意味します。これはAleoチームからの公式ニュースです。</p>

          <h4>Aleoテストネット報酬プログラムについて知っておくべきこと。</h4>

          <ul>
            <li>Aleoは、テストネット3のインセンティブとして、2500万Aleoクレジット（テストネット報酬）を確保しています。Aleoインセンティブ・プログラムの初期部分は、プルーバー（マイナー）に焦点が当てられます。今回のテストネット報酬プログラムは、2500万Aleoクレジットのうち、30%にあたる750万クレジットが割り当てられます。</li>
            <li>今テストネット報酬プログラムの期間は、2023年1月26日23:59UTCまで、または750万クレジットがすべてマイニングされるまで（どちらか早い方）です。</li>
            <li>メインネットのローンチ時には、Aleoクレジットは5対1（20%）のレートでAleoトークンに交換可能です。</li>
          </ul>

          <h3 id='Aleoプルーバー・インセンティブ・プログラムの参加方法とは？'>
            Aleoプルーバー・インセンティブ・プログラムの参加方法とは？
          </h3>

          <p>2023年1月26日23:59（UTC）までに、または750万クレジット（テストネット報酬）がすべてマイニングされるまでに、プロシオンのファーストバッチマイニング製品を購入した、または購入していた場合、メインネットのマイニング報酬に加えて追加のROIを受け取ることができます。</p>

          <h3 id='Aleoプルーバー・インセンティブ・プログラムで取得できるテストネット報酬はいくらですか？'>
            Aleoプルーバー・インセンティブ・プログラムで取得できるテストネット報酬はいくらですか？
          </h3>

          <p>テストネットでマイニングされたAleoクレジット（テストネット報酬）の20%はAleoトークンに交換可能であり、それはメインネットのシミュレーションROIに加え、追加のマイニング報酬を受け取ることができることを意味します。</p>

          <h3 id='Aleoファーストバッチマイニングは、1口でどれくらいのハッシュパワーが得られますか？'>
            Aleoファーストバッチマイニングは、1口でどれくらいのハッシュパワーが得られますか？
          </h3>

          <p>1口あたりのハッシュパワーの具体的な数値につきましては、メインネットが開始されるまで判明いたしません。</p>

          <p>背景として、マシンの最適化等によるハッシュパワーの変動があるためです。</p>

          <p>また、AleoはGPUマイニングを採用しているため、ハードディスクマイニングとは異なり、上記ハードウェアのようにメインネットワークが立ち上がった後もハッシュパワーが固定されることはございません。</p>

          <p>しかしながら、弊社マイニングプールパートナーは過去の実績から、他マイニングプールと比較し優位性がございますため、高い数値がでると想定されます。</p>

          <p>※名だたるマイニングプールが参加しているAleoのテストネットのランキングの中で、弊社マイニングプールパートナーはトップ5に位置しています。(2023年1月26日時点)</p>

          <h3 id='マイニング報酬は、マイニングが開始された日の翌日からProcyon.vipで確認できますか？'>
            マイニング報酬は、マイニングが開始された日の翌日からProcyon.vipで確認できますか？
          </h3>

          <p>はい、ダッシュボードにてご確認が可能です。<a target='_blank' @click='router.push({ path: "/dashboard" })'>ダッシュボードへのアクセスはこちらから</a>。</p>

          <h3 id='マイニングマシンが停電などのトラブルで機能停止することはないでしょうか？'>
            マイニングマシンが停電などのトラブルで機能停止することはないでしょうか？
          </h3>

          <p>弊社マイニングプールパートナーに確認をしたところ、バックアップがあるため停電において停止することはないとの回答をもらっています。その他のリスクにおいても冗長構成（予備のシステム）がとられております。</p>

          <p>※実際に停電などの事態が発生した場合は、皆さまへご報告いたします。</p>

          <h3 id='テストネットのマイニング報酬はProcyon.vipで確認できますか？'>
            テストネットのマイニング報酬はProcyon.vipで確認できますか？
          </h3>

          <p>はい、インセンティブプログラムが終了し集計可能となったテストネット報酬はProcyon.vipのマイニングダッシュボードにて確認が可能です。</p>

          <p>インセンティブプログラム未完了のテストネット報酬については、Aleo公式よりテストネット報酬についてのアップデートがございましたら、皆さまへご共有させていただきます。</p>

          <h3 id='テストネット報酬はどのくらい獲得できますか？'>
            テストネット報酬はどのくらい獲得できますか？
          </h3>

          <p>テストネット報酬の獲得数は、Aleo公式から発表がございました『インセンティブプログラム』が終了しますと算出可能となります。</p>

          <p>算出可能になり結果が判明しましたらお客様皆さまへお伝えさせていただきます。</p>

          <h3 id='マイニング報酬はいつから出金できますか？'>
            マイニング報酬はいつから出金できますか？
          </h3>

          <p>出金は、マイニング報酬がお客様のアカウントに着金しAleoが外部取引所にて上場しましたらいつでも可能です。</p>

          <h3 id='マイニング報酬および残高の出金上限はありますか？'>
            マイニング報酬および残高の出金上限はありますか？
          </h3>

          <p>出金上限はございます。</p>

          <p>出金の際に、表示がされるポップアップにてご確認をお願いいたします。</p>

          <div class='hr' />
        </div>
      </div>
    </template>
  </Page>
</template>

<script setup lang='ts'>
import { defineAsyncComponent } from 'vue'
import { scrollTo } from 'src/utils/scroll'
import { useRouter } from 'vue-router'

const Page = defineAsyncComponent(() => import('src/pages/faq/Page.vue'))
const router = useRouter()

</script>
