<template>
  <Page>
    <template #body>
      <h2>Iron Fish プロジェクト概要</h2>

      <div class='faq-content'>
        <div class='faq-content-nav'>
          <h3>目次</h3>

          <ul class='faq-nav-links'>
            <li><a @click='scrollTo("アイアン・フィッシュ マイニング製品")'>アイアン・フィッシュ マイニング製品</a></li>
            <li><a @click='scrollTo("アイアン・フィッシュ とは")'>アイアン・フィッシュ とは</a></li>
            <li><a @click='scrollTo("アイアン・フィッシュの技術概要")'>アイアン・フィッシュの技術概要</a></li>
            <li><a @click='scrollTo("なぜアイアン・フィッシュを選定したか？")'>なぜアイアン・フィッシュを選定したか？</a></li>
          </ul>

          <div class='hr' />
        </div>

        <div class='faq-content-main'>
          <h3 id='アイアン・フィッシュ マイニング製品' />

          <h4>製品詳細</h4>

          <p><strong>マイニング開始時期:</strong> アイアン・フィッシュのプロジェクトチームによる正式決定・発表時。最新情報に関しましては、毎週日曜日に開催されるProcyon公式セミナーにご参加ください。</p>

          <p><strong>マイニング期間: </strong>365日間 (メインネットローンチ後から)</p>

          <p><strong>技術サービス料: </strong>20%</p>

          <h3 id='アイアン・フィッシュ とは'>
            アイアン・フィッシュ とは
          </h3>

          <p>アイアン・フィッシュは、Aleoと同じくzk-SNARKを活用したレイヤー1のブロックチェーンです。現在のほとんどのブロックチェーンに欠けている、完全にプライベートな取引を可能にし、Web3においてのトランザクションの普遍的なプライバシーレイヤーとなることを目指しています。</p>

          <p>アイアン・フィッシュは、分散型のPoW (プルーフオブワーク) コンセンサス・アルゴリズムと、検閲に強い機能により、使いやすく、完全にプライベートな決済を提供し、Zcash (ジーキャッシュ) によって最初に作られたSaplingプロトコルを改良して、さらに効率的で安全なプライベート取引を可能にします。</p>

          <p>柔軟なインフラと開発者に優しい設計により、ノードオペレータ、マイナー、エンジニアの参入障壁は非常に低く、エコシステムの急速な成長が期待されます。</p>

          <h4>アイアン・フィッシュ 開発・運営会社情報</h4>

          <ul>
            <li><strong>法人名: </strong>Iron Fish</li>
            <li><strong>所在地: </strong>サンフランシスコ、カリフォルニア州、アメリカ</li>
            <li><strong>創設日: </strong>2018年</li>
            <li><strong>メインネットローンチ日: </strong>公式発表に依存する</li>
            <li><a href='https://ironfish.network/docs/whitepaper/1_introduction' target='_blank'>アイアン・フィッシュ ホワイトペーパー</a></li>
          </ul>

          <h3>主要構成メンバー</h3>

          <h4>エレナ・ナドリンスキ - 創業者</h4>

          <p>エレナは、世界をリードするIT企業のマイクロソフトとAirbnbで10年以上のソフトウェアエンジニアリングの経験を積み、プライバシーに焦点を当てた使いやすいブロックチェーン決済システムの需要を認識し、2018年にアイアン・フィッシュを設立しました。</p>

          <h4>ニール・ドーシ - コンテンツ責任者</h4>

          <p>ブロックチェーン分野で豊富な経験を持つニール氏は、レイヤー1のブロックチェーンであり、トークンの時価総額トップ50に入るFantom社でコンテンツ責任者を務めた経歴を有しています。ミシガン州立大学で博士号を取得後、非常に複雑なブロックチェーンの情報を、消費者にわかりやすいコンテンツにすることに専念しています。</p>

          <h4>メンバー概要</h4>

          <p>アイアン・フィッシュのチームメンバーは、Airbnb、Facebook、Google、Uberなどのトップクラスのプロダクトを構築し、数十年の経験を持つベテランです。エレナ氏とニール氏の傍らには、12人のエンジニアと受賞歴のあるデザイナー、そしてアイアン・フィッシュのエコシステムの開発と成長を促進するための暗号資産に精通したコミュニティマネージャーを含む14人のチームがいます。</p>

          <h3 id='アイアン・フィッシュの技術概要'>
            アイアン・フィッシュの技術概要
          </h3>

          <p>2023年以前のプライバシー重視のブロックチェーンは、いずれもプライバシー、アクセシビリティ、あるいはその両方の面で欠点がありました。アイアン・フィッシュは、プライバシーに妥協しない一方で、非常に使い勝手が良いのが特徴です。</p>

          <p>アプリケーションレイヤーは、一般的なプログラミング言語であるTypescriptで使われており、エンドユーザーによる簡単な統合やインタラクションを可能にしています。</p>

          <p>アイアン・フィッシュの重要な革新性は、政府の規制に準拠しながらも、完全なプライバシーを提供することです。ジーキャッシュやモネロは100％プライベートのため、犯罪者がそれらのチェーン上でマネーロンダリングなどの不正取引を行うことができてしまいます。</p>

          <p>アイアン・フィッシュは、デフォルトですべての取引が100％匿名ですが、どのユーザーも第三者、例えば政府の監査役にビューキーを渡すことができ、閲覧キー保有者のみがユーザーの取引を見ることができます。</p>

          <p>このように、アイアン・フィッシュのユーザーは、取引のプライバシーは日常的に守りながら、財務監査やマネーロンダリング防止 (AML) 調査を完全に遵守することができるので安心です。</p>

          <h3 id='なぜアイアン・フィッシュを選定したか？'>
            なぜアイアン・フィッシュを選定したか？
          </h3>

          <p>世界的に著名なWeb3のVCファンドや、エンジェル投資家が、アイアン・フィッシュの可能性に注目し、その開発に多大な投資を行っています。</p>

          <p>最初のエンジェル投資ラウンドでは、業界トップクラスの VCであるSlow Venturesとa16zの元ゼネラルパートナーで、コインベースの元CTOでもあるBalaji Srinivasanが中心となって、推定評価額$50~80ミリオン (約70億円〜100億円) で$5.3ミリオン (約7.2億円) の資金を調達しました。</p>

          <p>その後のラウンドでは、a16zが主導し、Sequoia、MetaStable、Electric Capital、Arrington Capitalといった世界有数のVCや、Dylan Field (Figmaの共同創業者) 、Alan Howard (イギリスのビリオネア、ヘッジファンドマネージャー)、Jeff Weiner (LinkedIn役員)、Divesh Makan (Iconiq Capitalパートナー) などのエンジェル投資家と一緒に$27ミリオン (約37億円) 、推定評価額$150-300ミリオン (約290億〜400億円) を調達しました。</p>

          <p>a16zは、アイアン・フィッシュへの投資を強く信じ、<a href='https://a16z.com/2021/11/30/investing-in-iron-fish/' target='_blank'>アイアン・フィッシュの優れた点と成功の理由を解説する記事</a>を書きました。</p>

          <p>アイアン・フィッシュは、プロシオンが案内しているAleoと競合する技術を提供していますが、それは、Web3におけるゼロ知識証明という領域について我々が非常に強気ということで、 したがって、多様な製品のポートフォリオを、コミュニティにご提供したいと考えています。 </p>

          <p>これから多くのブロックチェーンプロジェクトがゼロ知識証明を使い、構築されていくことが期待されます。</p>

          <p>Aleoとアイアン・フィッシュの違いの核心は、Aleoはメインネットのローンチ時からアプリケーション、NFT、ゲームなどのプログラマビリティを備えていることです。</p>

          <p>しかし、アイアン・フィッシュは将来のプログラマビリティのために、レイヤー2であるEVM (イーサリアム仮想マシン) を使用する予定です。</p>

          <div class='hr' />
        </div>
      </div>
    </template>
  </Page>
</template>

<script setup lang='ts'>
import { defineAsyncComponent } from 'vue'
import { scrollTo } from 'src/utils/scroll'
const Page = defineAsyncComponent(() => import('src/pages/faq/Page.vue'))

</script>
