<template>
  <Page>
    <template #body>
      <h2>Procyon プラットフォーム：情報セキュリティポリシー</h2>

      <div class='faq-content'>
        <div class='faq-content-nav'>
          <h3>ナビゲーション</h3>

          <ul class='faq-nav-links'>
            <li><a @click='scrollTo("KYC セキュリティ申請")'>KYC セキュリティ申請</a></li>
            <li><a @click='scrollTo("Google 認証システム")'>Google 認証システム</a></li>
            <li><a @click='scrollTo("暗号資産の出金監査")'>暗号資産の出金監査</a></li>
            <li><a @click='scrollTo("不正ログイン監査")'>不正ログイン監査</a></li>
            <li><a @click='scrollTo("不正取引の監査")'>不正取引の監査</a></li>
            <li><a @click='scrollTo("HTTPSで保護されたウェブサイト")'>HTTPSで保護されたウェブサイト</a></li>
            <li><a @click='scrollTo("不正ネットワークからのアクセス監査")'>不正ネットワークからのアクセス監査</a></li>
            <li><a @click='scrollTo("取引のオフライン署名")'>取引のオフライン署名</a></li>
            <li><a @click='scrollTo("暗号資産のコールド・ホットストレージ")'>暗号資産のコールド・ホットストレージ</a></li>
            <li><a @click='scrollTo("プライベートキーの暗号化")'>プライベートキーの暗号化</a></li>
            <li><a @click='scrollTo("RBAC認証システム")'>RBAC認証システム</a></li>
            <li><a @click='scrollTo("ハッシュ化されたパスワードの保存・管理")'>ハッシュ化されたパスワードの保存・管理</a></li>
          </ul>

          <div class='hr' />
        </div>

        <div class='faq-content-main'>
          <h3 id='KYC セキュリティ申請'>
            KYC セキュリティ申請
          </h3>

          <p>
            KYC（Know Your Client）とは、ユーザーの資産を保護するために必要な身元を確認するための方法です。
            ユーザーは、資産を管理し、支払いを実行する以前に、KYCを完了させる必要があります。本プラットフォームでは、
            KYC機能を利用することで、各資産運用が第三者ではなく、実際にユーザーによって行われていることを確認することができます。
            これにより、他人が偽り、ユーザー自身の資産を操作することを防ぐことができます。
          </p>

          <h3 id='Google 認証システム'>
            Google 認証システム
          </h3>

          <p>
            Google認証は、2段階認証の一種であり、ユーザーが設定するパスワードの上に二層目の保護としてワンタイムパスワードを使用します。
            この認証システムは、盗まれたパスワードでユーザーのアカウントにログインすることを防ぐ方法として広く利用されています。
            たとえハッカーが、ユーザーのパスワードを何かしらの方法で入手したとしても、Google認証に保存されているワンタイムパスワードを入手する可能性は極めて低く、
            ユーザーのアカウントにログインできないため、資金や個人情報を保護することができます。
          </p>

          <h3 id='暗号資産の出金監査'>
            暗号資産の出金監査
          </h3>

          <p>
            ユーザーが暗号資産を引き出す操作をした場合、この行為は、都度Procyonにより監査されます。
            当システムは、取引の安全性を確保するために、アカウント情報、KYC情報、送金先アドレス、およびその他の情報を精査します。
            当プラットフォームから出金する場合、ユーザーは送金先アドレスを事前にアカウント内で登録する必要があり、
            審査通過後にKYCが認証ずみかを確認するように設定されています。出金先アドレスが実際にご自身で設定したアドレスでない場合、
            出金取引は承認されません。短時間に多数の出金操作があった場合、ユーザーは取引を実施して、
            Procyonプラットフォームの管理者による手動監査を受ける必要がありますので、予めご了承ください。
          </p>

          <h3 id='不正ログイン監査'>
            不正ログイン監査
          </h3>

          <p>当システムは、ログインに異常がないかを自動的に監査します。</p>

          <p>
            例えば、ユーザーが普段使用しているブラウザやデバイスを変更したり、新しい場所からログインしようとしたりした場合、
            システムが認識してユーザーに通知します。また、Procyonプラットフォームは、一度に1つのログインのみを許可することで、
            同時ログインを制限します。さらに、アカウントにログインしてから4時間後には自動的にログアウトされ、再度ログインを求められます。
            当システムは、ユーザーの身元を確認するために、アカウントへの再ログインが必要になります。
          </p>

          <h3 id='不正取引の監査'>
            不正取引の監査
          </h3>

          <p>Procyonプラットフォームは、各取引を自動的に確認し、検証します。</p>

          <p>
            当システムは、各取引でユーザーのアカウント情報と一致することを要求してから、取引を完了させます。
            たとえハッカーが当プラットフォームのAPIを攻撃してもユーザー情報を取得できなければ、
            不正なユーザー情報を使用して取引を実行することはできません。
          </p>

          <h3 id='HTTPSで保護されたウェブサイト'>
            HTTPSで保護されたウェブサイト
          </h3>

          <p>HTTPSは、認証と暗号化された通信手段を基礎に構築されています。</p>

          <p>決済など、オンライン上の安全な通信に広く利用されています。HTTPSは、ブラウザで提供されるウェブページの暗号化と認証により、通信プロセスをより安全にします。</p>

          <h3 id='不正ネットワークからのアクセス監査'>
            不正ネットワークからのアクセス監査
          </h3>

          <p>
            Procyonは、取引などを行うために、プライベートネットワークを利用しています。当プラットフォームはアクセス権のリストを管理し、リストにあるデバイス/IPにのみアクセスを許可しています。取引が実施されるサブシステムへのネットワーク接続は一方向であり、外部からの接続は受け付けません。
          </p>

          <h3 id='取引のオフライン署名'>
            取引のオフライン署名
          </h3>

          <p>
            各暗号資産取引が契約書のようなものだとすると、取引が有効であるためには、各取引において契約書へのデジタル署名が必要となります。
            当システムでは、このデジタル署名がオフライン（インターネットに接続されていない状態）で行われるように設計されているため、
            ハッカーがネットワークを攻撃し、ユーザーに偽りデジタル署名を行い取引を有効化させることを防ぐことができます。
          </p>

          <h3 id='暗号資産のコールド・ホットストレージ'>
            暗号資産のコールド・ホットストレージ
          </h3>

          <p>
            Procyonは、一定量以上の暗号資産を定め、オフライン（インターネットに接続されていない状態）のコールドウォレットにて資産を保管及び管理します。
            このコールドウォレットから暗号資産を出金するには、何重もの操作による審査が必要であり、ハッカーがインターネット経由で暗号資産にアクセスすることはできません。
            当プラットフォームのホットウォレット（オンライン上）に保管する暗号資産は、プラットフォームでの1日の典型的な取引量をまかなう少量に限定されています。
            これにより、大量の資産が一度に失われることを物理的に防いでいます。
          </p>

          <h3 id='プライベートキーの暗号化'>
            プライベートキーの暗号化
          </h3>

          <p>
            それぞれのプライベートキーは、ランダムなパスワードで二重に暗号化されています。
            たとえハッカーが一つのプライベートキーの暗号化されたデータにアクセスしたとしても、
            それを直接使うことはできず、ましてやそれを使って取引を実行することもできません。
            また、一つのプライベートキーにアクセスできたとしても、他のプライベートキーへのアクセスは許可されない仕組みです。
          </p>

          <h3 id='RBAC認証システム'>
            RBAC認証システム
          </h3>

          <p>
            RBAC（Role-based Access Control）は、リソース、役割、許可の3つの要素からなる権限管理・認証システムです。
            RBACは、ユーザーの役割と権限を定義及び設定し、その権限によってシステムへのアクセスを許可することで、ハッキングなどのセキュリティリスクを回避します。
          </p>

          <h3 id='ハッシュ化されたパスワードの保存・管理'>
            ハッシュ化されたパスワードの保存・管理
          </h3>

          <p>ハッシュ化とは、ある特定の文字列や数字の配列を一定のルールに基づいた計算手順によって置き換えることを意味します。</p>

          <p>
            ユーザーアカウントのパスワードはすべてハッシュ化されたデータで保存されているため、ユーザーが設定した通りにはプラットフォームに保存されません。
            これは、システム構築の上でユーザーデータを引き出す際に便利なようにハッシュ化されたパスワードのみを保存しています。
            たとえハッカーがハッシュ化されたパスワードを入手しても、そのデータを利用しユーザーのアカウントにログインすることはできません。
          </p>

          <p>Procyonの技術チームは、サイバーセキュリティの分野で豊富な経験を有しています。前述では、当プラットフォームに導入しているセキュリティ対策の概要を記載させて頂きました。</p>

          <p>
            さらに、Procyonの技術チームは、セキュリティの分野では5年以上、ソフトウェアエンジニアリングの分野では10年以上の経験があり、
            これまでセキュリティに関するトラブルを起こすことなく業務に努めてきました。
          </p>

          <p>これからも皆様の安全かつ快適な暗号資産ライフをサポートできるよう注力致します。</p>

          <div class='hr' />
        </div>
      </div>
    </template>
  </Page>
</template>

<script setup lang='ts'>
import { defineAsyncComponent } from 'vue'
import { scrollTo } from 'src/utils/scroll'

const Page = defineAsyncComponent(() => import('src/pages/faq/Page.vue'))

</script>
