<template>
  <div class='content'>
    <h1>本当に優れたマイニングプールの見極め方</h1>
    <p>多くのマイニングプールがありますが、全てが同じではありません</p>
    <div class='info-table-container'>
      <table class='info-table'>
        <thead>
          <tr>
            <th id='aqua'>
              <span>優秀なマイニングプール</span>
            </th>
            <th id='pink'>
              <span>劣っているマイニングプール</span>
            </th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td id='aqua'>
              トップクラスのマイニングプールが選ぶプロジェクトは、世界中から参加可能で、マイニングのディフィカルティ（難易度）は競争の激化に伴い上昇しています。
            </td>
            <td id='pink'>
              大きなプロジェクトのマイニングに参加できない。選ぶプロジェクトが、特定の国・地域からしかマイニングできない、かつ大型マイニングプールが参加しないようなプロジェクト。
            </td>
          </tr>
          <tr>
            <td id='aqua'>
              マイニング機器は実在し、大半はデータセンターで運用されている。
            </td>
            <td id='pink'>
              マイニング機器は実在せず、データセンター以外で運用されている。
            </td>
          </tr>
          <tr>
            <td id='aqua'>
              技術開発のみを行い、プロジェクトチームは自らハッシュパワーを販売しない。
            </td>
            <td id='pink'>
              プロジェクトチームは自らハッシュパワーを販売する。
            </td>
          </tr>
          <tr>
            <td id='aqua'>
              メインネットワークが正式リリース後、マイニング報酬は公式ルールに従って毎日配布される。
            </td>
            <td id='pink'>
              マイニング報酬が支払われる際にトラブルが頻発し、配布は遅延またはスキップされる。
            </td>
          </tr>
          <tr>
            <td id='aqua'>
              マイニング報酬は公式ルールに従っていつでも出金できる。
            </td>
            <td id='pink'>
              マイニング報酬の出金は制限される。
            </td>
          </tr>
          <tr>
            <td id='aqua'>
              チームメンバーは世界上位大学と大手企業出身。
            </td>
            <td id='pink'>
              チームメンバーのキャリアはブロックチェーンと無関係。
            </td>
          </tr>
        </tbody>
      </table>
    </div>
  </div>
  <div class='hr' />
</template>
