<template>
  <div class='content legal'>
    <div id='hero'>
      <h1>Procyon — PRCN Technology</h1>

      <h2>利用規約</h2>
    </div>

    <h4>要約</h4>

    <p>お客様に関連する重要なポイントを冒頭にまとめます。</p>

    <ul>
      <li>私たちは、お客様の情報を第三者に販売することはなく、個人情報を保護します。しかし、私たちのコミュニティにサービスを提供するために必要な技術的および事業的運営のために、私たちはあなたの情報を、私たちがあなたにサービスを提供するために必要とする第三者のパートナーやベンダーに提供する場合があります。</li>
      <li>提供される情報はすべて真実かつ正確であり、当社が設定したガイドラインに従ってKYCを完了するようお願いします。</li>
      <li>暗号資産商品はリスクを伴う可能性があること、またPROCYON LABS PTE. LTD.は、政府の政策の変更、市場の影響、不可抗力などによる損失について責任を負いません。</li>
      <li>PROCYON LABS PTE. LTD.は、ユーザーが現地の法律を遵守するとして、グローバルなウェブサイトを運営しています。各ユーザーはPROCYON LABS PTE. LTD.のサービスを使用する際に、自身の行動に対して責任を負います。居住地でそのようなサービスを利用することが法的に許可されていることの確認はユーザー自身でおこなう必要があります。</li>
    </ul>

    <div class='hr' />

    <h1>利用規約</h1>

    <p>当ウェブサイトはPROCYON LABS PTE. LTD.と外部サービスプロバイダーにより運営されています。当ウェブサイトにアクセス、内容閲覧、ユーザー登録、当ウェブサイトからいかなる資料のダウンロード、あるいは当ウェブサイトから提供された資料を使う場合、下記の条項を遵守することに同意するものと見なします。これらの条項はPROCYON LABS PTE. LTD.とユーザーの間の合意を意味します。これらの条項を遵守することに同意しない場合は、当ウェブサイトを使用できません。PROCYON LABS PTE. LTD.は通知なしにいつでも下記の条項を更新する権利を保有しています。これらの更新内容についても、あなたは遵守しなければなりません。いかなる時間、場合においても、PROCYON LABS PTE. LTD.はあらゆるユーザーのアクセス・利用を拒否する権利があります。PROCYON LABS PTE. LTD.は規約などに関して随時訂正、修正、更新する権利を保有します。</p>

    <h2>1. 著作権に関して</h2>

    <p>PROCYON LABS PTE. LTD.は独立して当ウェブサイトの関連ページ内すべての著作権を保有しています。あるいは当ウェブサイトの関連ページ内の情報の提供者と共同で当ウェブサイト内の情報の著作権及び、当ウェブサイトの使用権を保有しています。PROCYON LABS PTE. LTD.の明確な書面での許可なしに、当ウェブサイト上のいかなる内容に対しても複製または非PROCYON LABS PTE. LTD.所属のサーバー上でミラーリングをしてはいけません。</p>

    <p>当ウェブサイトに掲載されているドメイン名、商標、文字、映像および音声コンテンツ、図および画像は、いずれも関連商標と著作権の法的保護を受けています。PROCYON LABS PTE. LTD.から事前に書面で明確な許可を得てない限り、いかなる企業あるいは個人もいかなる形式で複製または伝達してはいけません。当ウェブサイトを無許可で使用する行為はすべて「シンガポール共和国著作権法」、「シンガポール共和国商標法」及びその他関連法律法規及び国際条約に関する規定に違反します。</p>

    <h2>2. 利用者の情報およびプライバシーに関する権利の保護</h2>

    <p>弊社はユーザーのプライバシーを尊重し、ユーザーの同意なしに、ユーザーの情報を収集および、ユーザーのプライバシーを侵害する疑いのある内容を漏らしません。サービスの必要に応じて把握したユーザー名、電子メール、情報、住所などについては、ユーザーの許可なしに、いかなる第三者にも販売または提供しません。PROCYON LABS PTE. LTD.はユーザーが当ウェブサイトに登録したいかなる資料を公開しませんが、下記の場合を除きます。</p>

    <ul>
      <li>裁判所、仲裁機関の裁判または裁決、その他の司法手続の要求に従う場合</li>
      <li>関連政府主管部門の要求に従う場合</li>
      <li>利用者が使用規約の規定に違反し、またその他マイニングマシン賃貸プラットフォームの利益を損なう行為に対応する場合</li>
      <li>その他法律法規に関する要求へ対応する場合</li>
      <li>当社のサービスを履行するための技術的および業務的な対応に必要な場合</li>
    </ul>

    <p>ユーザーが当ウェブサイトへの登録をしてから、PROCYON LABS PTE. LTD.が提供できるサービスを利用する場合、以下の事項に同意したと見なします。当ウェブサイトのサービス登録表の提示に従って、ご本人の真実、正確、最新及び完備した資料を提供してください。登録資料を随時更新して、真実、正確、最新かつ完全な資料であることを確認してください。もし何かの間違いのある、虚偽、過去の不完全または誤解のある資料を提供した場合、または当ウェブサイトは上記の資料が間違いのある、虚偽、過去の不完全または誤解のある資料と疑われる理由がある場合、当ウェブサイトはユーザーのアカウントを一時停止または停止する権利があります。また、当ウェブサイトが提供された現在および将来にわたって当ウェブサイトが提供するサービスの全部または任意の部分の提供を拒否できます。</p>

    <h2>3. 商標およびドメイン名に関する声明</h2>

    <p>PROCYON LABS PTE. LTD.のウェブサイト（www.procyon.vip）を使用しているすべてのPROCYON LABS PTE. LTD.の図案及び文字の商標は、中国または他の国におけるPROCYON LABS PTE. LTD.の登録商標または合法的に使用された商標であり、PROCYON LABS PTE. LTD.から書面による明確な許可を得ていない限り、いかなる単位または個人もいかなる方式であっても上記の商標を使用してはいけません。PROCYON LABS PTE. LTD.のウェブサイトのドメイン名はPROCYON LABS PTE. LTD.の所有です。PROCYON LABS PTE. LTD.の書面による許可を受けていない限り、いかなる単位または個人も使用してはいけません。</p>

    <h2>4. ウェブサイトへのリンク</h2>

    <p>当ウェブサイトへのリンクをご希望の場合は、ご連絡ください。PROCYON LABS PTE. LTD.の書面許可を得てから、当ウェブサイトにリンクできます。リンクを確立した後、例えばPROCYON LABS PTE. LTD.が客観的状況によってリンクに適しないと判断した場合、リンクの許可を取り消す権利があります。当ウェブサイトにリンクする際は、必ずテキストリンク（PROCYON LABS PTE. LTD.の書面許可がない場合は、PROCYON LABS PTE. LTD.の図案及び文字のリンク方式を使用してはいけません）を使用してください。当ウェブサイトのリンクをクリックして新規ウィンドウに表示する形式に設定します。リンク先ウェブサイトの枠組みの中に表示することはできません。</p>

    <h2>5. 責任免除</h2>

    <p>お客様は、いかなる状況においても、PROCYON LABS PTE. LTD.は以下の各事項について責任を負わないことに同意します。</p>

    <ul>
      <li>（1）取引の損失</li>
      <li>（（2）取引利益または契約損失</li>
      <li>（（3）業務の中断</li>
      <li>（（4）情報の損失</li>
      <li>（（5）データの破損または損失</li>
      <li>（（6）ハッシュレートの消失または市場から退出する場合の損失</li>
      <li>（（7）政策要因による損失</li>
      <li>（（8）不可抗力による損失</li>
    </ul>

    <p>PROCYON LABS PTE. LTD. のウェブサイトにログインまたは使用（直接および間接使用を含む）は、この声明を受け入れて承認したものと見なされます。本声明の内容はシンガポール共和国の関連法律に基づき締結され、本声明の内容はシンガポール共和国の関連法律に基づいて解釈、適用されます。</p>

    <div class='hr' />

    <h1>プライバシーポリシー</h1>

    <p>私たちはユーザーとウェブサイトの訪問者（総称して「お客様」といいます）のプライバシーを尊重し、オンラインのプライバシーを守るために最善を尽くします。このプライバシーポリシーはPROCYON LABS PTE. LTD.とその関連組織（以下、「PROCYON LABS PTE. LTD.」または「私たち」という）の管理、収集、維持、処理のユーザー個人データの流れを概説しています。当社はプライバシーポリシーの更新・変更がある場合、登録したユーザーにメールにてお知らせします。このプライバシーポリシーを定期的に確認して変更を知ることをお勧めします。本プライバシーポリシーの変更がある場合、このページを公開する際に有効となります。</p>

    <h2>1. 情報収集</h2>

    <p>私たちはお客様の個人データを使って、PROCYON LABS PTE. LTD.からお客様に提供されたマイニングマシン共有サービス（「サービス」）を提供し、使用体験を改善していきます。「個人データ」とは、識別された人または識別可能な人に関する任意の情報をいいます。サービスを利用するためにアカウントを作成すると、お客様が提供した情報を内部データベースで管理します。また、Cookie、ピクセルタグ、ローカルストレージ（ブラウザネットワーク記憶またはアプリケーションデータキャッシュ、データベース、サーバログ等）を含む様々な技術を使用して情報を収集し、記憶しています。サービスまたは当ウェブサイトをご利用いただくと、このプライバシーポリシーに従って情報を収集し利用することに同意するということです。このプライバシーポリシーに別の規定がない限り、本プライバシーポリシーで使用される用語は私たちのサービス規約と同じ意味を持っています。</p>

    <h3>1.1 登録</h3>

    <p>アカウントを作成するには、メール、電話、パスワードなどのデータを提供する必要があります。上記の情報の提供を拒否すると、サービスを提供することができません。</p>

    <h3>1.2 KYC (本人確認) の登録</h3>

    <p>KYCを完了する際に、身分証明証の表画像、身分証明証の裏画像、パスポートの画像、および前述の身分証明証を持った最近の写真などの情報を提供することが必要となります。</p>

    <h3>1.3 支払情報</h3>

    <p>お客様の支払情報は第三者支払処理者に送信され、お客様の使用は許可されたものとみなされます。私たちはお客様の暗号化されたウォレットのアドレスを保存できます。当社はお客様のアカウント内の暗号通貨ウォレットのアドレスを保存することができます。また、当社の第三者支払処理者を通じてユーザー情報を保存します。</p>

    <h3>1.4 ログイン情報</h3>

    <p>PROCYON LABS PTE. LTD.は、お客様がアカウントを登録する際に、ブラウザから得た情報を収集します。このデータには、以下の情報が含まれています。お客様のコンピューターやスマートフォンのインターネットプロトコル（IP）アドレス、ブラウザの種類、ブラウザのバージョン、お客様がアクセスしたページ、アクセス時間、日付、これらのページの滞在時間と他の統計データがあります。また、Google Analyticsなどの第三者サービスを使って、このような情報を収集、監視、分析し、サービスの機能性を向上させることができます。これらの第三者サービスプロバイダーは自身のプライバシーポリシーが存在し、情報の使い道を説明しています。これらの第三者サービスプロバイダーは、当社が任務を遂行するために必要な際にのみ、お客様の個人データを表示することができます。</p>

    <h3>1.5 お客様の情報の使用用途</h3>

    <p>お客様が提供した個人情報は、次の目的の為に使われる可能性があります。</p>

    <ul>
      <li>（1）当ウェブサイトとウェブサイトの一部として表示するため</li>
      <li>（2）当社のシステムのユーザーとして識別するため</li>
      <li>（3）注文処理のため</li>
      <li>（4）カスタマーサービスを提供するため</li>
      <li>（5）ご要望にお応えするため</li>
      <li>（6）製品のアップデートを提供するため</li>
      <li>（7）当ウェブサイトを改善するため</li>
      <li>（8）当社の製品に関するニュース通信、調査、特恵及びその他の宣伝資料を送るため</li>
      <li>（9）お客様とコミュニケーションをとるため</li>
      <li>（10）リスクを管理し当ウェブサイトを保護するため。当社のサービスとお客様を詐欺行為から守るため</li>
      <li>（11）適用されるすべての法律と法規を遵守し、当ウェブサイトとPROCYON LABS PTE. LTD.のサービス改善を実行するため</li>
      <li>（12）その他、お客様の同意を得た目的のため</li>
    </ul>

    <h3>1.6 Cookieに関する情報</h3>

    <p>より良いウェブサイトアクセス体験を提供するため、当社は「Cookie」を使用して、当ウェブサイトがお客様のブラウザを識別し、ユーザーの好みやその他の情報を保存することができます。ブラウザの追加サービスが許可されている場合は、Cookieの許容度を変更したり、Cookieを拒否することができます。詳細についてはAboutCookies.orgをご参考ください。ただし、場合によっては当ウェブサイトを訪問する体験に影響を与える可能性があります。あるいは、当社の一部のサービスを利用できない可能性もあります。</p>

    <h2>2. 第三者サービスプロバイダ</h2>

    <p>第三者サービスプロバイダーを採用して業務関連のサービスを提供する可能性があります。第三者は、サービスを提供している間のみ、お客様の個人データにアクセスすることができ、情報漏れを徹底的に防止し、他の目的で使用してはいけない義務があります。ただし、当社は第三者のサービスプロバイダーにお客様の個人データを提供する行為は、第三者のサービスプロバイダーのユーザー情報に対する権利侵害またはプライバシー侵害行為に対していかなる法的責任を負うものとはみなされません。</p>

    <h2>3. ヨーロッパ経済区（EEA）の住民のお客様</h2>

    <p>お客様がヨーロッパ経済区（EEA）の住民である場合、適用の法律法規に基づいて特定のデータ保護権利があります。当社の目標は合理的な措置を取り、修正、削除、または制限することです。お客様が、当社が保有している個人情報をシステムから削除したい場合、当社にご連絡ください。ただし、当社はヨーロッパ経済区（EEA）の住民のデータ操作に対して、いかなる法的責任は負いません。</p>

    <h2>4. 情報セキュリティ</h2>

    <p>当社はウェブサイトとそれに紐づくサービスを保護することに力を尽くしていますが、お客様にも個人情報の安全を守る責任があり、お客様の個人情報が正確で最新のものであるかを確認します。当社は、許可なしにお客様のアカウントにアクセスするのを防ぐ必要があります。公共の場の共有コンピューターを使用する場合は、必ずログアウトすることを推奨します。また、許可されていない方にアカウントのパスワードと他のアカウントの登録情報を開示しなようご注意ください。</p>

    <p>しかし、インターネットを介して伝送される方法や電子記憶方法は100%安全ではありません。したがって、お客様の個人情報を守るために最善を尽くすとともに、絶対的な安全性を保証することはできません。当社はお客様が当ウェブサイトの登録で提供する情報、または当社のサービスを通じての個人情報の安全性を保証することができません。</p>

    <h2>5. 国際データ転送</h2>

    <p>お客様の情報を提出することによって、お客様の情報（個人データを含む）がお客様の国/地域の管轄範囲外のコンピュータとシステムに転送され保存される可能性があります。もしこのような転送が発生したら、お客様の情報がお客様の国/地域の規定のレベルとほぼ同じように保護されていることを確認します。しかし、当社はこの保護行為の結果に対して法的責任を負うことができません。</p>

    <h2>6. 第三者リンク</h2>

    <p>当社のサービスには、当社が運営していない第三者のウェブサイトへのリンクが含まれている場合があります。お客様がそのようなリンクをクリックした場合、関連する第三者のウェブサイトに移動することもあります。本プライバシーポリシーは、他の第三者のウェブサイトには適用されません。訪問先のウェブサイトのプライバシーポリシーを確認することをお勧めします。当社は、第三者のウェブサイトやそのサービス内容、プライバシーポリシーを管理することはできず、一切の責任を負いません。</p>

    <h2>7. 未成年のプライバシー保護</h2>

    <p>当社は、故意に18歳以下の方の個人情報を収集、保有することはありません。さらに当ウェブサイトは、16歳以下の方を対象とするものではありません。18歳未満、または満18歳以上で自身の労働収入を主な収入源としない場合は、いかなる方法で当ウェブサイトを使用したり、アクセスしたりしないようお願いします。当社は、18歳以下の方の個人情報を収集していると把握した際、法律適用法規によって削除、または他の適切な措置を取ります。</p>

    <h2>8. 個人データの使用目的の変更</h2>

    <p>当社は、お客様の個人データを本プライバシーポリシー宣言以外のいかなる目的に使う場合、お客様に通知し、また有効な退出方法を提供します。本プライバシーポリシーの規定外の目的に自身の個人データを使用できないようします。</p>

    <p>当社は、新サービスと今後の活動に関するメールを送る可能性があります。送信されたメールの中から「購読キャンセル」機能を選択して、PROCYON LABS PTE. LTD.の定期メールの受信を拒否することもできます。しかし、サービスを利用することに同意したユーザーは、本サービスに関する他の重要なメールを引き続き受信することを推奨します。</p>

    <h2>9. 情報保存期間</h2>

    <p>適用される法律および規制によって要求されない限り、当社は、本プライバシーポリシーに記載された目的を実現するために必要な期間内でのみ、お客様の個人情報を保管および保存します。法律で認められている状況下で、当社は、記録保持を目的として、または法的手段により当社の権利と利益を保証するために、特定の個人情報を保存することがあります。当社による情報の保存および保管は、関連する法律および規則の要件に従って行われ、当社は情報の保存行為についていかなる法的責任も負いません。</p>

    <h2>10. お客様の個人情報を理解、取得、変更または削除する方法</h2>

    <p>当社がお客様のデータを処理していることの確認、当社が保有しているお客様の個人情報へのアクセス、当社が収集したお客様の個人情報の変更または削除を希望される場合は、本プライバシーポリシーに記載されている連絡先にてご連絡ください。</p>

    <h2>11. 連絡方法</h2>

    <p>本プライバシーポリシーに対してのご質問がある場合、当社までお問い合わせください。</p>

    <h1>サービス利用規約</h1>

    <h2>PROCYON LABS PTE. LTD.のアカウント登録サービス規約</h2>

    <p>登録サービス規約（以下「本規約」といいます）は、PROCYON LABS PTE. LTD.のサービスに関連して、PROCYON LABS PTE. LTD.およびその関連会社のサービスに関連する、お客様とPROCYON LABS PTE. 本ウェブサイトにアクセスおよび/または使用することにより、ユーザーは本規約のすべての条項を受諾し、同意するものとします。プロキオンラブズPTE. LTD.は、本規約の条件を変更する権利を有し、一度発行された改訂された規約は、元の規約に効果的に取って代わるものとします。ユーザーはいつでも最新の規約を確認することができます。</p>

    <h2>サービス内容</h2>

    <p>1. PROCYON LABS PTE. LTD.は自社システムを利用し、ユーザーにマイニングマシンのレンタルと委託管理及びインターネットを活用した新しいサービスを提供します。</p>

    <p>2. ユーザーが提出した登録書類について、ユーザーは：（1）合法、真実、正確、詳細な個人資料を提供する。（2）内容に変更がある場合、適時に登録書類を更新する。ユーザーが真実、正確かつ完全でない情報を提供した場合、当社は、当社の判断に基づき、お客様との取引の全部もしくは一部を停止し、または登録を抹消することがあります。これにより生じた損害については、当社は一切責任を負わないものとします。</p>

    <h2>ユーザーの権利</h2>

    <p>1. 利用者のユーザー名、パスワードと安全性：（1）ユーザーはPROCYON LABS PTE. LTD.の登録について選択する権利があり、PROCYON LABS PTE. LTD.登録ユーザーになる場合、自分でアカウントを作ることができます。ユーザー名の命名と使用は関連法律法規を遵守し、ネットワークコンプライアンスに適合しなければなりません。アカウント名にはいかなる侮辱、脅威、猥褻、罵倒など他人の合法的権益を侵害する文字を含むことはできません。（2）ユーザーが登録に成功すれば、PROCYON LABS PTE. LTD.の登録ユーザーとなり、アカウント（携帯番号またはメールアドレス）とパスワードを取得し、アカウントとパスワードでシステムに登録した後に発生したすべての活動とイベントに対して責任を負い、アカウントを使用時言語、行為などの直接または間接による法的責任を負う。（3）ユーザーはPROCYON LABS PTE. LTD.のアカウントとパスワード、ショートメッセージの認証コード、Googleの認証コードを適切に保管する義務があり、ユーザー名とパスワード、Google二段階認証の安全に対して全責任を負う。ユーザーの原因でユーザー名やパスワード、Google二段階認証が漏れた場合の法的結果は、ユーザー本人が責任を負うものとし、ユーザー自身がこれらの情報を漏らしたことによる財産損失についてPROCYON LABS PTE. LTD.は責任を負いません。（4）パスワードをなくした場合、電子メールで送信されたリンクを登録してパスワードをリセットすることができます。不正なユーザーアカウントや、他のセキュリティホールがあることを発見した場合、直ちにPROCYON LABS PTE. LTDへ通知してください。</p>

    <p>2. PROCYON LABS PTE. LTD.の承諾：法律規程により、またはユーザーの事前許可なしに、PROCYON LABS PTE. LTD.はいかなる第三者にユーザーのパスワード、名前、携帯番号などの非公開情報を開示しません。</p>

    <p>3. ユーザーはPROCYON LABS PTE. LTD.が提供した各オンライン、オフライン活動に参加する権利があります。</p>

    <p>4. ユーザーはPROCYON LABS PTE. LTD.のウェブサイトの規定に基づいて、PROCYON LABS PTE. LTD.が提供するその他の各種サービスを利用する権利があります。</p>

    <h2>ユーザーの義務</h2>

    <p>1. PROCYON LABS PTE. LTD.を利用して国家の安全を害し、国家の秘密を漏洩し、国家社会集団の合法的権益を侵害してはいけません。PROCYON LABS PTE. LTD.で以下の情報を作成、複製、伝播してはいけない。（1）反抗を扇動し、憲法と法律、行政法規を破壊し、実施したもの。（2）国家政権を転覆させ、社会主義制度を覆すよう扇動したもの。（3）国家分裂を扇動し、国家統一を破壊するもの。（4）民族憎悪、民族差別を扇動し、民族団結を破壊するもの。（5）事実を捏造し、歪曲し、デマをとばし、社会秩序を乱すもの。（6）封建迷信、猥褻、ポルノ、ギャンブル、暴力、殺人、恐怖、教唆犯罪を宣伝するもの。（7）他人を公然と侮辱したり、事実を捏造して他人を誹謗したり、その他の悪意のある攻撃をするもの。、（8）国家機関の信用を損なうもの。（9）その他の憲法及び法律行政法規に違反するもの。（10）商業広告行為を行うもの。</p>

    <p>2. ユーザーはPROCYON LABS PTE. LTD.のウェブサイトのアカウントを不審なアクティビティや悪意を持って作成することは禁じられています。下記の行為を含みますが、これに限りません。不当利得、投機、現金化、受賞などを目的とした複数のアカウントを登録、他のユーザーアカウントを盗用。もしユーザーが上記の規定に違反した場合、PROCYON LABS PTE. LTD.は直接にあらゆる必要な措置を取り、違反で利益を得たことを取り消し、訴訟の形式を通じてユーザーの法律責任などを追及する権利があります。</p>

    <p>3. ユーザーがPROCYON LABS PTE. LTD.をいかなる形式で各種の不法活動に従事する場所、プラットフォームまたは媒介とすることを禁止します。PROCYON LABS PTE. LTD.の授権または許可を得ていない場合、ユーザーは当駅の名義を使用し、いかなる商業活動に従事してもいけません。また、いかなる形式でもPROCYON LABS PTE. LTD.を商業活動の場所、プラットフォームまたは媒介として使用してはいけません。</p>

    <h2>免責条項</h2>

    <p>1. インターネットの特殊性に基づいて、PROCYON LABS PTE. LTD.のサービスが中断されないことは保証されていません。サービスの適時性、安全性については保証しません。PROCYON LABS PTE. LTD.の原因ではない損失による責任は負いません。PROCYON LABS PTE. LTD.は、ユーザーが当ウェブサイトを安全にアクセスし、使用することができるようにするために力を尽くしますが、PROCYON LABS PTE. LTD.は、当ウェブサイトやサーバーがウイルスやその他の潜在的な有害要素を含んでいないことを保証していません。そのため、ユーザーは、業界で公認されているソフトウェアを使って、PROCYON LABS PTE. LTD.からダウンロードされたファイルのウイルスを調べてください。特にハッカーの侵入行為や類似の行為についても、私たちはいかなる責任も負いかねます。</p>

    <p>2. PROCYON LABS PTE. LTD.はユーザーが発表した情報の保存、修正、削除、または保存に失敗した場合、責任を負いません。当ウェブサイト上の非PROCYON LABS PTE. LTD.の故意による植字ミス、不注意などに対しては責任を負いません。PROCYON LABS PTE. LTD.はウェブサイト上の漏れや誤りについて改善の権利はありますが義務ではありません。</p>

    <p>3. PROCYON LABS PTE. LTD.が書面で明確に約束していない限り、PROCYON LABS PTE. LTD.はユーザーに対していかなる方式（経由、接続またはダウンロードを含むがこれに限らない）で当ウェブサイトから得られたいかなる情報（広告などを含むがこれに限らない）についてその正確性、完全性、信頼性を保証しません。ユーザーが当ウェブサイト上の情報により購入、取得したいかなる製品、サービスまたは資料についてPROCYON LABS PTE. LTD.は責任を負いません。ユーザーは、当ウェブサイトの情報を使用することによるリスクを自己負担します。</p>

    <p>4. すべてのユーザーに送る通知は、PROCYON LABS PTE. LTD.が正式なページ広告、ダイレクトメッセージ、電子メール、カスタマーサービス電話、携帯メールまたは普通郵便を通じて伝達されます。いかなる非PROCYON LABS PTE. LTD.の正規ルートを通じて獲得した当選、割引などの活動や情報は、PROCYON LABS PTE. LTD.が法律責任を負いません。</p>

    <h2>情報の秘密保持</h2>

    <p>1. 本規約でいうPROCYON LABS PTE. LTD.のユーザー情報とは、法律、法規及び関連規定に適合し、下記の範囲に適合する情報を指します。（1）ユーザーがPROCYON LABS PTE. LTD.に登録する時、PROCYON LABS PTE. LTD.に提供する個人情報（2）ユーザーがPROCYON LABS PTE. LTD.サービス、ウェブサイト活動またはウェブページを訪問する時、PROCYON LABS PTE. LTD.が自動的に受信し記録するユーザブラウザ端末または携帯電話のクライアントデータ、IPアドレス、ウェブサイトのCookieの中の資料とユーザーが使用するウェブページの記録を含みまます、これらに限定しません。（3）PROCYON LABS PTE. LTD.はビジネスパートナーから合法的に入手したユーザー個人情報です。</p>

    <p>2. PROCYON LABS PTE. LTD.の承諾：法律により、またはユーザーの事前許可なしに、PROCYON LABS PTE. LTD.はいかなる第三者にユーザーのパスワード、名前、携帯番号などの非公開情報を開示しません。</p>

    <p>3. 下記の法定の状況において、ユーザーの個人情報は一部または全部開示されます。（1）ユーザーの同意を得て、ユーザー本人または他の第三者に開示する。（2）法律、法規等の関連規定、或いは行政機構の要求に基づき、行政、司法機構又はその他の法律規定の第三者に開示する。（3）その他のPROCYON LABS PTE. LTD.が法律、法規などの関連規定に基づいて開示する。</p>

    <h2>サービスの提供、修正及び終了</h2>

    <p>1. ユーザーはPROCYON LABS PTE. LTD.の各サービスを受けると同時に、PROCYON LABS PTE. LTD.から提供される各種情報サービスを受けることに同意します。ユーザーはPROCYON LABS PTE. LTD.にその電子メール、携帯電話、通信住所などに商業情報を送ることの権限を許可します。ユーザーはPROCYON LABS PTE. LTD.関連ページにアクセスして資料を変更することができます。</p>

    <p>2. PROCYON LABS PTE. LTD.は随時修正またはサービスを中断し、ユーザーに通知しない権利を保留します。PROCYON LABS PTE. LTD.はサービスを修正または中断する権利があり、ユーザーまたは直接関係のない第三者に責任を負う必要がありません。</p>

    <p>3. ユーザーは本規約の修正に異議があり、またはPROCYON LABS PTE. LTD.のサービスに不満がある場合、以下の権利を行使することができます。（1）PROCYON LABS PTE. LTD.のネットサービスの使用を停止する。（2）開発者メールアドレスなど合理的なルートを通じて、PROCYON LABS PTE. LTD.に対するサービスの停止を書面で効果的に通知します。サービス終了後、ユーザーがPROCYON LABS PTE. LTD.サービスを利用する権利は直ちに終了します。この場合、PROCYON LABS PTE. LTD.は未処理の情報または未完成のサービスをユーザーまたは直接関係のない第三者に転送する義務がありません。</p>

    <h2>適用法律と裁判所</h2>

    <p>1. ユーザーがPROCYON LABS PTE. LTD.のウェブサイトを使用したことにより、または関連するあらゆる論争、権利主張またはその他の事項は、いずれもPROCYON LABS PTE. LTD.所在地の法律の管轄を受けます。</p>

    <p>2. ユーザーとPROCYON LABS PTE. LTD.で論争が発生した場合、まず誠実と信用の原則に基づいて協議を通じて解決しなければなりません。協議が成立しない場合、PROCYON LABS PTE. LTD.の所在地の裁判所に訴訟を提起することになります。</p>

    <div class='hr' />
  </div>
</template>
